In [2]:
print('Hello')

Hello

In [3]:
pwd

'C:\\Users\\moins\\OneDrive\\Desktop\\Udemy\\UDEMY_TSA_FINAL\\Moin'

In [4]:
import numpy as np
import pandas as pd

In [7]:
np.arange(1,16).reshape(5,3)

array([[ 1,  2,  3],
       [ 4,  5,  6],
       [ 7,  8,  9],
       [10, 11, 12],
       [13, 14, 15]])

In [28]:
np.random.seed(101)
arr =np.random.randn(20).reshape(4,5)

In [34]:
df = pd.DataFrame(arr,index = ('A B C D').split(), columns = ('P Q R S T').split())

In [35]:
df

          P         Q         R         S         T
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [42]:
df.loc[['C']]

          P         Q         R         S         T
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237

In [43]:
df

          P         Q         R         S         T
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [46]:
df['States']  = 'IN PAK CH NP'.split()

In [56]:
df.set_index('States')

               P         Q         R         S         T
States
IN      2.706850  0.628133  0.907969  0.503826  0.651118
PAK    -0.319318 -0.848077  0.605965 -2.018168  0.740122
CH      0.528813 -0.589001  0.188695 -0.758872 -0.933237
NP      0.955057  0.190794  1.978757  2.605967  0.683509

In [60]:
df.set_index('States',inplace= True)

In [61]:
df

               P         Q         R         S         T
States
IN      2.706850  0.628133  0.907969  0.503826  0.651118
PAK    -0.319318 -0.848077  0.605965 -2.018168  0.740122
CH      0.528813 -0.589001  0.188695 -0.758872 -0.933237
NP      0.955057  0.190794  1.978757  2.605967  0.683509

In [118]:
(df['Q']>0).value_counts()

True     2
False    2
Name: Q, dtype: int64

True     2
False    2
Name: Q, dtype: int64

In [120]:
pwd

'C:\\Users\\moins\\OneDrive\\Desktop\\Udemy\\UDEMY_TSA_FINAL\\Moin'

In [132]:
df = pd.read_csv('../Data/starbucks.csv')

In [126]:
df.head()

         Date    Close    Volume
0  2015-01-02  38.0061   6906098
1  2015-01-05  37.2781  11623796
2  2015-01-06  36.9748   7664340
3  2015-01-07  37.8848   9732554
4  2015-01-08  38.4961  13170548